using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DiffCode.CommonEntities.GrammarServices;

/// <summary>
/// Константы.
/// </summary>
public static class Constants
{

  /// <summary>
  /// Организационно-правовые формы.
  /// </summary>
  public static class LegalEntities
  {

    /// <summary>
    /// Список прилагательных.
    /// </summary>
    public static List<string> Adjectives =>
    [
      "Полное",
      "Акционерное",
      "Унитарное",
      "Производственный",
      "Хозяйственное",
      "Индивидуальный",
      "Простое",
      "Инвестиционное",
      "Некоммерческое",
      "Публичное",
      "Непубличное",
      "Федеральное",
      "Государственное",
      "Муниципальное",
      "Бюджетное",
      "Областное",
    ];


    /// <summary>
    /// Список существительных.
    /// </summary>
    public static List<string> Nouns =>
    [
      "Общество",
      "Товарищество",
      "Предприятие",
      "Кооператив",
      "Предприниматель",
      "Партнерство",
      "Учреждение",
    ];


    /// <summary>
    /// Список паттернов.
    /// </summary>
    public static List<string> Patterns =>
    [
      @"публичное|непубличное акционерное общество *",
      @"индивидуальный предприниматель",
      @"инвестиционное|полное|простое товарищество *",
      @"общество *",
      @"федеральное государственное унитарное предприятие *",
      @"производственный кооператив *",
      @"хозяйственное|некоммерческое партнерство *",
      @"товарищество *",
    ];

  }


  /// <summary>
  /// Основания полномочий подписантов.
  /// </summary>
  public static class Authorities
  {

    /// <summary>
    /// Список существительных.
    /// </summary>
    public static List<string> Nouns =>
    [
      "устав",
      "доверенность",
      "распоряжение",
      "приказ"
    ];

    /// <summary>
    /// Список паттернов.
    /// </summary>
    public static List<string> Patterns =>
    [
      @"устав|доверенность|приказ|распоряжение"
    ];

  }


  /// <summary>
  /// Названия разрядов числительных.
  /// </summary>
  public static class Digits
  {

    /// <summary>
    /// Список названий.
    /// </summary>
    public static List<string> Nouns =>
    [
      "десятитысячная",
      "тысячная",
      "сотая",
      "десятая",
      "целая",
      "тысяча",
      "миллион",
      "миллиард",
      "триллион",
      "квадриллион",
      "квинтиллион",
      "секстиллион",
    ];


    public static List<string> Patterns =>
    [

    ];

  }


  /// <summary>
  /// Названия сторон.
  /// </summary>
  public static class Parties
  {

    /// <summary>
    /// Список прилагательных.
    /// </summary>
    public static List<string> Adjectives =>
    [
      "Доверительный",
      "Управляющая",
      "Финансовый",
      "Доверенное"
    ];


    /// <summary>
    /// Список существительных.
    /// </summary>
    public static List<string> Nouns =>
    [
      "Автор",
      "Агент",
      "Арендатор",
      "Арендодатель",
      "Бригада",
      "Гарант",
      "Даритель",
      "Дилер",
      "лицо",
      "Доверитель",
      "управляющий",
      "Должник",
      "Дольщик",
      "Жертвователь",
      "Задаткодатель",
      "Задаткополучатель",
      "Заемщик",
      "Займодавец",
      "Заказчик",
      "Залогодатель",
      "Залогодержатель",
      "Застройщик",
      "Инвестор",
      "Исполнитель",
      "Клиент",
      "Комиссионер",
      "Комитент",
      "Компания",
      "Контрагент",
      "Кредитор",
      "Лизингодатель",
      "Лизингополучатель",
      "Лицензиар",
      "Лицензиат",
      "Одаряемый",
      "Пассажир",
      "Перевозчик",
      "Плательщик",
      "Поверенный",
      "Подрядчик",
      "Поклажедатель",
      "Покупатель",
      "Получатель",
      "Пользователь",
      "Поручитель",
      "Поставщик",
      "Правообладатель",
      "Принципал",
      "Приобретатель",
      "Продавец",
      "Работник",
      "Работодатель",
      "Ссудодатель",
      "Ссудополучатель",
      "Субагент",
      "Субкомиссионер",
      "Судовладелец",
      "организация",
      "Ученик",
      "Учредитель",
      "Фрахтователь",
      "Хранитель",
      "Цедент",
      "Цессионарий",
      "Экспедитор",
    ];


    /// <summary>
    /// Список паттернов.
    /// </summary>
    public static List<string> Patterns =>
    [
      @"автор",
      @"(финансовый) агент|гарант|субагент",
      @"арендатор",
      @"арендодатель",
      @"бригада",
      @"даритель",
      @"дилер",
      @"доверенное лицо",
      @"доверитель",
      @"доверительный|финансовый управляющий",
      @"должник",
      @"дольщик",
      @"жертвователь",
      @"задаткодатель",
      @"задаткополучатель",
      @"заемщик",
      @"заимодавец",
      @"заказчик",
      @"залогодатель",
      @"залогодержатель",
      @"застройщик",
      @"инвестор",
      @"исполнитель",
      @"клиент",
      @"комиссионер",
      @"комитент",
      @"(управляющая) компания",
      @"контрагент",
      @"кредитор",
      @"лизингодатель",
      @"лизингополучатель",
      @"лицензиар",
      @"лицензиат",
      @"одаряемый",
      @"пассажир",
      @"перевозчик",
      @"плательщик *",
      @"поверенный",
      @"подрядчик",
      @"поклажедатель",
      @"покупатель",
      @"получатель *",
      @"пользователь",
      @"поручитель",
      @"поставщик",
      @"правообладатель",
      @"принципал",
      @"приобретатель",
      @"продавец",
      @"работник",
      @"работодатель",
      @"ссудодатель",
      @"ссудополучатель",
      @"субкомиссионер",
      @"судовладелец",
      @"управляющая организация",
      @"ученик",
      @"учредитель",
      @"фрахтователь",
      @"хранитель",
      @"цедент",
      @"цессионарий",
      @"экспедитор",
    ];

  }


  /// <summary>
  /// Названия должностей подписантов.
  /// </summary>
  public static class Positions
  {

    /// <summary>
    /// Список прилагательных.
    /// </summary>
    public static List<string> Adjectives =>
    [
      "Административный",
      "Генеральный",
      "Главный",
      "Исполнительный",
      "Коммерческий",
      "Неформальный",
      "Первый",
      "Производственный",
      "Старший",
      "Технический",
      "Управляющмй",
      "Финансовый",
    ];


    /// <summary>
    /// Список существительных.
    /// </summary>
    public static List<string> Nouns =>
    [
      "Директор",
      "Заведующий",
      "Заместитель",
      "Инженер",
      "Конструктор",
      "Менеджер",
      "Бухгалтер",
      "Начальник",
      "Партнер",
      "Председатель",
      "Президент",
      "Редактор",
      "Руководитель",
      "Вице-президент",
      "Собственник",
    ];


    /// <summary>
    /// Список паттернов.
    /// </summary>
    public static List<string> Patterns =>
    [
      @"(административный|генеральный|исполнительный|коммерческий|производственный|технический|управляющий|финансовый) директор",
      @"генеральный партнер|конструктор|менеджер",
      @"главный инженер|конструктор|редактор|бухгалтер",
      @"неформальный собственник",
      @"(первый|старший) заместитель *",
      @"(первый) вице-президент",
      @"старший конструктор|менеджер|партнер|вице-президент",
      @"технический руководитель",
      @"управляющий|исполнительный партнер|вице-президент",
      @"финансовый менеджер|руководитель",
      @"(менеджер|начальник|заведующий|председатель|руководитель|директор) *",
      @"президент|редактор",
    ];

  }


  /// <summary>
  /// Единицы измерения.
  /// </summary>
  public static class Units
  {


    /// <summary>
    /// Список прилагательных.
    /// </summary>
    public static List<string> Adjectives =>
    [
      "рабочий",
      "календарный"
    ];


    /// <summary>
    /// Список существительных.
    /// </summary>
    public static List<string> Nouns =>
    [
      "минута",
      "час",
      "день",
      "неделя",
      "месяц",
      "квартал",
      "полугодие",
      "год",
      "рубль",
      "копейка",
      "доллар",
      "цент",
      "евро",
      "евроцент",
      "экземпляр",
      "штука",
      "процент",
      "доля",
      "число",
    ];


    /// <summary>
    /// Список паттернов.
    /// </summary>
    public static List<string> Patterns =>
    [
      @"минута",
      @"час",
      @"(рабочий|календарный) день",
      @"неделя",
      @"месяц",
      @"квартал",
      @"полугодие",
      @"год",
      @"рубль",
      @"копейка",
      @"доллар",
      @"цент",
      @"евро",
      @"евроцент",
      @"экземпляр",
      @"штука",
      @"процент",
      @"доля",
      @"число",
    ];

  }


  /// <summary>
  /// Мужские и женские имена и отчества.
  /// </summary>
  public static class PersonNames
  {

    /// <summary>
    /// Список женских имен.
    /// </summary>
    public static List<string> FNames =>
    [
      "Августа",
      "Авдотья",
      "Агата",
      "Аглая",
      "Агния",
      "Аграфена",
      "Ада",
      "Аделаида",
      "Аделина",
      "Азалия",
      "Аксинья",
      "Алевтина",
      "Александра",
      "Алёна",
      "Алика",
      "Алина",
      "Алиса",
      "Алла",
      "Алсу",
      "Амалия",
      "Анастасия",
      "Ангелина",
      "Анжелика",
      "Анна",
      "Антонина",
      "Анфиса",
      "Арабелла",
      "Арина",
      "Ася",
      "Белла",
      "Бриджит",
      "Валентина",
      "Валерия",
      "Ванда",
      "Ванесса",
      "Варвара",
      "Василиса",
      "Васса",
      "Венера",
      "Вера",
      "Вероника",
      "Виктория",
      "Виола",
      "Виолетта",
      "Галина",
      "Гаяне",
      "Гаянэ",
      "Генриетта",
      "Грета",
      "Дана",
      "Дарья",
      "Диана",
      "Дина",
      "Ева",
      "Евгения",
      "Евдокия",
      "Екатерина",
      "Елена",
      "Елизавета",
      "Есения",
      "Жанна",
      "Земфира",
      "Зинаида",
      "Зоя",
      "Изабелла",
      "Илона",
      "Инга",
      "Ингрид",
      "Инесса",
      "Инна",
      "Ирина",
      "Ирма",
      "Ия",
      "Карина",
      "Кира",
      "Клара",
      "Кристина",
      "Ксения",
      "Лада",
      "Лариса",
      "Лидия",
      "Лика",
      "Лилия",
      "Лина",
      "Линда",
      "Лия",
      "Лолита",
      "Луиза",
      "Любовь",
      "Людмила",
      "Магда",
      "Майя",
      "Малика",
      "Маргарита",
      "Марика",
      "Марина",
      "Мариэтта",
      "Мария",
      "Марта",
      "Марфа",
      "Милана",
      "Милена",
      "Мирослава",
      "Мирра",
      "Моника",
      "Надежда",
      "Наиля",
      "Наталия",
      "Наталья",
      "Нелли",
      "Ника",
      "Нина",
      "Нинель",
      "Нонна",
      "Оксана",
      "Олеся",
      "Ольга",
      "Пелагея",
      "Полина",
      "Прасковья",
      "Рада",
      "Раиса",
      "Регина",
      "Рената",
      "Римма",
      "Рина",
      "Роза",
      "Руфина",
      "Сара",
      "Сарра",
      "Светлана",
      "Снежана",
      "София",
      "Софья",
      "Сусанна",
      "Таисия",
      "Тамара",
      "Татьяна",
      "Теона",
      "Тереза",
      "Тина",
      "Ульяна",
      "Фаина",
      "Эдна",
      "Элеонора",
      "Элла",
      "Эльвира",
      "Эмма",
      "Юлия",
      "Яна",
    ];

    /// <summary>
    /// Список мужских имен в формате ИМЯ-МУЖСКОЕ ОТЧЕСТВО-ЖЕНСКОЕ ОТЧЕСТВО.
    /// </summary>
    public static List<ValueTuple<string, string, string>> MNames =>
    [
      new("Абрам","Абрамович","Абрамовна"),
      new("Август","Августович","Августовна"),
      new("Авраам","Авраамович","Авраамовна"),
      new("Автандил","Автандилович","Автандиловна"),
      new("Агафон","Агафонович","Агафоновна"),
      new("Адальберт","Адальбертович","Адальбертовна"),
      new("Адам","Адамович","Адамовна"),
      new("Азиз","Азизович","Азизовна"),
      new("Акакий","Акакиевич","Акакиевна"),
      new("Аким","Акимович","Акимовна"),
      new("Акоп","Акопович","Акоповна"),
      new("Алан","Аланович","Алановна"),
      new("Александр","Александрович","Александровна"),
      new("Алексей","Алексеевич","Алексеевна"),
      new("Али","Алиевич","Алиевна"),
      new("Альберт","Альбертович","Альбертовна"),
      new("Альфред","Альфредович","Альфредовна"),
      new("Амвросий","Амвросиевич","Амвросиевна"),
      new("Амир","Амирович","Амировна"),
      new("Анатолий","Анатольевич","Анатольевна"),
      new("Андрей","Андреевич","Андреевна"),
      new("Андрон","Андронович","Андроновна"),
      new("Андроник","Андроникович","Андрониковна"),
      new("Антон","Антонович","Антоновна"),
      new("Аполлинарий","Аполлинарьевич","Аполлинарьевна"),
      new("Аполлон","Аполлонович","Аполлоновна"),
      new("Аристарх","Аристархович","Аристарховна"),
      new("Аристотель","Аристотелевич","Аристотелевна"),
      new("Аркадий","Аркадьевич","Аркадьевна"),
      new("Арман","Арманович","Армановна"),
      new("Армен","Арменович","Арменовна"),
      new("Арсений","Арсеньевич","Арсеньевна"),
      new("Артем","Артемович","Артемовна"),
      new("Артём","Артёмович","Артёмовна"),
      new("Артур","Артурович","Артуровна"),
      new("Архип","Архипович","Архиповна"),
      new("Аскольд","Аскольдович","Аскольдовна"),
      new("Афанасий","Афанасьевич","Афанасьевна"),
      new("Ахмад","Ахмадович","Ахмадовна"),
      new("Ахмат","Ахматович","Ахматовна"),
      new("Ахмед","Ахмедович","Ахмедовна"),
      new("Ахмет","Ахметович","Ахметовна"),
      new("Ашот","Ашотович","Ашотовна"),
      new("Богдан","Богданович","Богдановна"),
      new("Борис","Борисович","Борисовна"),
      new("Борислав","Бориславович","Бориславовна"),
      new("Бронислав","Брониславович","Брониславовна"),
      new("Бруно","Брунович","Бруновна"),
      new("Булат","Булатович","Булатовна"),
      new("Вадим","Вадимович","Вадимовна"),
      new("Валентин","Валентинович","Валентиновна"),
      new("Валерий","Валерьевич","Валерьевна"),
      new("Вальдемар","Вальдемарович","Вальдемаровна"),
      new("Варнава","Варнавович","Варнавовна"),
      new("Варфоломей","Варфоломеевич","Варфоломеевна"),
      new("Василий","Васильевич","Васильевна"),
      new("Вахтанг","Вахтангович","Вахтанговна"),
      new("Велимир","Велимирович","Велимировна"),
      new("Вениамин","Вениаминович","Вениаминовна"),
      new("Венцеслав","Венцеславович","Венцеславовна"),
      new("Викентий","Викентьевич","Викентьевна"),
      new("Виктор","Викторович","Викторовна"),
      new("Вильгельм","Вильгельмович","Вильгельмовна"),
      new("Виссарион","Виссарионович","Виссарионовна"),
      new("Виталий","Витальевич","Витальевна"),
      new("Витовт","Витовтович","Витовтовна"),
      new("Витольд","Витольдович","Витольдовна"),
      new("Владимир","Владимирович","Владимировна"),
      new("Владислав","Владиславович","Владиславовна"),
      new("Владлен","Владленович","Владленовна"),
      new("Всеволод","Всеволодович","Всеволодовна"),
      new("Всеслав","Всеславович","Всеславовна"),
      new("Вячеслав","Вячеславович","Вячеславовна"),
      new("Гавриил","Гаврилович","Гавриловна"),
      new("Гарри","Гарриевич","Гарриевна"),
      new("Гейдар","Гейдарович","Гейдаровна"),
      new("Геннадий","Геннадьевич","Геннадьевна"),
      new("Генрик","Генрикович","Генриковна"),
      new("Генрих","Генрихович","Генриховна"),
      new("Георгий","Георгиевич","Георгиевна"),
      new("Герасим","Герасимович","Герасимовна"),
      new("Герберт","Гербертович","Гербертовна"),
      new("Герман","Германович","Германовна"),
      new("Геронтий","Геронтиевич","Геронтиевна"),
      new("Герхард","Герхардович","Герхардовна"),
      new("Глеб","Глебович","Глебовна"),
      new("Гордей","Гордеевич","Гордеевна"),
      new("Григорий","Григорьевич","Григорьевна"),
      new("Гунар","Гунарович","Гунаровна"),
      new("Давид","Давидович","Давидовна"),
      new("Дамир","Дамирович","Дамировна"),
      new("Даниил","Даниилович","Данииловна"),
      new("Данила","Данилович","Даниловна"),
      new("Данияр","Даниярович","Данияровна"),
      new("Демид","Демидович","Демидовна"),
      new("Демьян","Демьянович","Демьяновна"),
      new("Денис","Денисович","Денисовна"),
      new("Дмитрий","Дмитриевич","Дмитриевна"),
      new("Дорофей","Дорофеевич","Дорофеевна"),
      new("Евгений","Евгеньевич","Евгеньевна"),
      new("Евграф","Евграфович","Евграфовна"),
      new("Евдоким","Евдокимович","Евдокимовна"),
      new("Евсей","Евсеевич","Евсеевна"),
      new("Егор","Егорович","Егоровна"),
      new("Емельян","Емельянович","Емельяновна"),
      new("Ермолай","Ермолаевич","Ермолаевна"),
      new("Ерофей","Ерофеевич","Ерофеевна"),
      new("Ефим","Ефимович","Ефимовна"),
      new("Ефрем","Ефремович","Ефремовна"),
      new("Закир","Закирович","Закировна"),
      new("Заур","Заурович","Зауровна"),
      new("Захар","Захарович","Захаровна"),
      new("Зиновий","Зиновьевич","Зиновьевна"),
      new("Зосима","Зосимович","Зосимовна"),
      new("Зураб","Зурабович","Зурабовна"),
      new("Ибрагим","Ибрагимович","Ибрагимовна"),
      new("Иван","Иванович","Ивановна"),
      new("Игнат","Игнатович","Игнатовна"),
      new("Игнатий","Игнатьевич","Игнатьевна"),
      new("Игорь","Игоревич","Игоревна"),
      new("Израиль","Израилевич","Израилевна"),
      new("Илларион","Илларионович","Илларионовна"),
      new("Ильдар","Ильдарович","Ильдаровна"),
      new("Илья","Ильич","Ильинична"),
      new("Иммануил","Иммануилович","Иммануиловна"),
      new("Иннокентий","Иннокентьевич","Иннокентьевна"),
      new("Иоанн","Иоаннович","Иоанновна"),
      new("Иосиф","Иосифович","Иосифовна"),
      new("Ипполит","Ипполитович","Ипполитовна"),
      new("Ираклий","Ираклиевич","Ираклиевна"),
      new("Иса","Исаевич","Исаевна"),
      new("Исаак","Исакович","Исаковна"),
      new("Ислам","Исламович","Исламовна"),
      new("Исмаил","Исмаилович","Исмаиловна"),
      new("Исраэль","Исраэлевич","Исраэлевна"),
      new("Ицхак","Ицхакович","Ицхаковна"),
      new("Кадир","Кадирович","Кадировна"),
      new("Казимир","Казимирович","Казимировна"),
      new("Камиль","Камильевич","Камильевна"),
      new("Карен","Каренович","Кареновна"),
      new("Карл","Карлович","Карловна"),
      new("Карп","Карпович","Карповна"),
      new("Керим","Керимович","Керимовна"),
      new("Ким","Кимович","Кимовна"),
      new("Кирилл","Кириллович","Кирилловна"),
      new("Клим","Климович","Климовна"),
      new("Климент","Климентович","Климентовна"),
      new("Константин","Константинович","Константиновна"),
      new("Корней","Корнеевич","Корнеевна"),
      new("Кузьма","Кузьмич","Кузьминична"),
      new("Лаврентий","Лаврентьевич","Лаврентьевна"),
      new("Лазарь","Лазаревич","Лазаревна"),
      new("Лев","Львович","Львовна"),
      new("Леонард","Леонардович","Леонардовна"),
      new("Леонид","Леонидович","Леонидовна"),
      new("Леопольд","Леопольдович","Леопольдовна"),
      new("Лука","Лукич","Лукинишна"),
      new("Лукьян","Лукьянович","Лукьяновна"),
      new("Людвиг","Людвигович","Людвиговна"),
      new("Люциан","Люцианович","Люциановна"),
      new("Макар","Макарович","Макаровна"),
      new("Максим","Максимович","Максимовна"),
      new("Максимилиан","Максимилианович","Максимилиановна"),
      new("Малик","Маликович","Маликовна"),
      new("Мамед","Мамедович","Мамедовна"),
      new("Марат","Маратович","Маратовна"),
      new("Марк","Маркович","Марковна"),
      new("Мартин","Мартинович","Мартиновна"),
      new("Мартын","Мартынович","Мартыновна"),
      new("Матвей","Матвеевич","Матвеевна"),
      new("Махмуд","Махмудович","Махмудовна"),
      new("Мераб","Мерабович","Мерабовна"),
      new("Мирон","Миронович","Мироновна"),
      new("Мирослав","Мирославович","Мирославовна"),
      new("Михаил","Михайлович","Михайловна"),
      new("Модест","Модестович","Модестовна"),
      new("Моисей","Моисеевич","Моисеевна"),
      new("Мстислав","Мстиславович","Мстиславовна"),
      new("Мурад","Мурадович","Мурадовна"),
      new("Мурат","Муратович","Муратовна"),
      new("Назар","Назарович","Назаровна"),
      new("Наиль","Наильевич","Наильевна"),
      new("Натан","Натанович","Натановна"),
      new("Наум","Наумович","Наумовна"),
      new("Нестор","Несторович","Несторовна"),
      new("Никандр","Никандрович","Никандровна"),
      new("Никанор","Никанорович","Никаноровна"),
      new("Никита","Никитич","Никитишна"),
      new("Никифор","Никифорович","Никифоровна"),
      new("Никодим","Никодимович","Никодимовна"),
      new("Николай","Николаевич","Николаевна"),
      new("Нил","Нилович","Ниловна"),
      new("Нобель","Нобелевич","Нобелевна"),
      new("Ованес","Ованесович","Ованесовна"),
      new("Олег","Олегович","Олеговна"),
      new("Осип","Осипович","Осиповна"),
      new("Оскар","Оскарович","Оскаровна"),
      new("Осман","Османович","Османовна"),
      new("Остап","Остапович","Остаповна"),
      new("Отто","Оттович","Оттовна"),
      new("Павел","Павлович","Павловна"),
      new("Петр","Петрович","Петровна"),
      new("Пётр","Петрович","Петровна"),
      new("Платон","Платонович","Платоновна"),
      new("Поликарп","Поликарпович","Поликарповна"),
      new("Порфирий","Порфирьевич","Порфирьевна"),
      new("Потап","Потапович","Потаповна"),
      new("Прохор","Прохорович","Прохоровна"),
      new("Рамадан","Рамаданович","Рамадановна"),
      new("Рамазан","Рамазанович","Рамазановна"),
      new("Рамиль","Рамильевич","Рамильевна"),
      new("Ратмир","Ратмирович","Ратмировна"),
      new("Рафаэль","Рафаэлевич","Рафаэлевна"),
      new("Рафик","Рафикович","Рафиковна"),
      new("Рашид","Рашидович","Рашидовна"),
      new("Реваз","Ревазович","Ревазовна"),
      new("Ринат","Ринатович","Ринатовна"),
      new("Роберт","Робертович","Робертовна"),
      new("Родион","Родионович","Родионовна"),
      new("Роман","Романович","Романовна"),
      new("Ростислав","Ростиславович","Ростиславовна"),
      new("Рубен","Рубенович","Рубеновна"),
      new("Рудольф","Рудольфович","Рудольфовна"),
      new("Руслан","Русланович","Руслановна"),
      new("Рустам","Рустамович","Рустамовна"),
      new("Рустем","Рустемович","Рустемовна"),
      new("Рушан","Рушанович","Рушановна"),
      new("Савва","Саввович","Савишна"),
      new("Савелий","Савельевич","Савельевна"),
      new("Саид","Саидович","Саидовна"),
      new("Салават","Салаватович","Салаватовна"),
      new("Салман","Салманович","Салмановна"),
      new("Самвел","Самвелович","Самвеловна"),
      new("Самсон","Самсонович","Самсоновна"),
      new("Самуил","Самуилович","Самуиловна"),
      new("Святослав","Святославович","Святославовна"),
      new("Семен","Семенович","Семеновна"),
      new("Семён","Семёнович","Семёновна"),
      new("Сергей","Сергеевич","Сергеевна"),
      new("Сильвестр","Сильвестрович","Сильвестровна"),
      new("Симеон","Симеонович","Симеоновна"),
      new("Соломон","Соломонович","Соломоновна"),
      new("Спартак","Спартакович","Спартаковна"),
      new("Спиридон","Спиридонович","Спиридоновна"),
      new("Станислав","Станиславович","Станиславовна"),
      new("Степан","Степанович","Степановна"),
      new("Сулейман","Сулейманович","Сулеймановна"),
      new("Султан","Султанович","Султановна"),
      new("Сурен","Суренович","Суреновна"),
      new("Тарас","Тарасович","Тарасовна"),
      new("Теймураз","Теймуразович","Теймуразовна"),
      new("Теодор","Теодорович","Теодоровна"),
      new("Терентий","Терентьевич","Терентьевна"),
      new("Тигран","Тигранович","Тиграновна"),
      new("Тимофей","Тимофеевич","Тимофеевна"),
      new("Тимур","Тимурович","Тимуровна"),
      new("Трофим","Трофимович","Трофимовна"),
      new("Усман","Усманович","Усмановна"),
      new("Фаддей","Фаддеевич","Фаддеевна"),
      new("Фарид","Фаридович","Фаридовна"),
      new("Федор","Федорович","Федоровна"),
      new("Фёдор","Фёдорович","Фёдоровна"),
      new("Федот","Федотович","Федотовна"),
      new("Феликс","Феликсович","Феликсовна"),
      new("Фердинанд","Фердинандович","Фердинандовна"),
      new("Филипп","Филиппович","Филипповна"),
      new("Флюр","Флюрович","Флюровна"),
      new("Фома","Фомич","Фоминишна"),
      new("Франц","Францевич","Францевна"),
      new("Фридрих","Фридрихович","Фридриховна"),
      new("Фрол","Фролович","Фроловна"),
      new("Харитон","Харитонович","Харитоновна"),
      new("Христофор","Христофорович","Христофоровна"),
      new("Цезарь","Цезаревич","Цезаревна"),
      new("Эдвард","Эдвардович","Эдвардовна"),
      new("Эдгар","Эдгарович","Эдгаровна"),
      new("Эдмон","Эдмонович","Эдмоновна"),
      new("Эдмунд","Эдмундович","Эдмундовна"),
      new("Эдуард","Эдуардович","Эдуардовна"),
      new("Эльдар","Эльдарович","Эльдаровна"),
      new("Эмиль","Эмильевич","Эмильевна"),
      new("Эммануил","Эммануилович","Эммануиловна"),
      new("Эрик","Эрикович","Эриковна"),
      new("Эрнст","Эрнстович","Эрнстовна"),
      new("Юлиан","Юлианович","Юлиановна"),
      new("Юлий","Юльевич","Юльевна"),
      new("Юрий","Юрьевич","Юрьевна"),
      new("Яков","Яковлевич","Яковлевна"),
      new("Якуб","Якубович","Якубовна"),
      new("Ян","Янович","Яновна"),
      new("Ярослав","Ярославович","Ярославовна"),

    ];



  }


  /// <summary>
  /// Данные для грамматик для мужских и женских имен, отчеств и фамилий.
  /// </summary>
  public static class PersonNameGrammars
  {

    /// <summary>
    /// Список данных для грамматик для женских имен.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FFirstNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[аезйлось]я"] = new("я", "и", "е", "ю", "ей", "е"),
      ["[бвдеёжзийлмнпрстфхцчшщ]а"] = new("а", "ы", "е", "у", "ой", "е"),
      ["[длмр]и"] = new("и", "и", "и", "и", "и", "и"),
      ["[Ии]я"] = new("я", "и", "и", "ю", "ей", "и"),
      ["[кг]а"] = new("а", "и", "е", "у", "ой", "е"),
      ["бель"] = new("бель", "бель", "бель", "бель", "бель", "бель"),
      ["нель"] = new("нель", "нель", "нель", "нель", "нель", "нель"),
      ["шель"] = new("шель", "шель", "шель", "шель", "шель", "шель"),
      ["кель"] = new("кель", "кель", "кель", "кель", "кель", "кель"),
      ["бет"] = new("бет", "бет", "бет", "бет", "бет", "бет"),
      ["ид"] = new("ид", "ид", "ид", "ид", "ид", "ид"),
      ["ит"] = new("ит", "ит", "ит", "ит", "ит", "ит"),
      ["не"] = new("не", "не", "не", "не", "не", "не"),
      ["су"] = new("су", "су", "су", "су", "су", "су"),
      ["ь"] = new("ь", "и", "и", "ь", "ью", "и"),
      ["э"] = new("э", "э", "э", "э", "э", "э"),
    };


    /// <summary>
    /// Список данных для грамматик для мужских имен.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MFirstNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[адиоуя]р"] = new("р", "ра", "ру", "ра", "ром", "ре"),
      ["[ао]в"] = new("в", "ва", "ву", "ва", "вом", "ве"),
      ["[бвдеёжзийлмнпрстфхцчшщ]а"] = new("а", "ы", "е", "у", "ой", "е"),
      ["[бгджзкмнпстфхцчшщ]"] = new("", "а", "у", "а", "ом", "е"),
      ["[длмр]и"] = new("и", "и", "и", "и", "и", "и"),
      ["[ес]тр"] = new("тр", "тра", "тру", "тра", "тром", "тре"),
      ["[илор]л"] = new("л", "ла", "лу", "ла", "лом", "ле"),
      ["[лр]ь"] = new("ь", "я", "ю", "я", "ем", "е"),
      ["[мтв]а"] = new("а", "ы", "е", "у", "ой", "е"),
      ["[рт]о"] = new("о", "о", "о", "о", "о", "о"),
      ["авел"] = new("авел", "авла", "авлу", "авла", "авлом", "авле"),
      ["ай"] = new("ай", "ая", "аю", "ая", "аем", "ае"),
      ["ви"] = new("ви", "ви", "ви", "ви", "ви", "ви"),
      ["ев"] = new("ев", "ева", "еву", "ева", "евым", "еве"),
      ["ей"] = new("ей", "ея", "ею", "ея", "еем", "ее"),
      ["ео"] = new("ео", "ео", "ео", "ео", "ео", "ео"),
      ["ётр"] = new("ётр", "етра", "етру", "етра", "етром", "етре"),
      ["ий"] = new("ий", "ия", "ию", "ия", "ием", "ии"),
      ["ка"] = new("ка", "ки", "ке", "ку", "кой", "ке"),
      ["мвел"] = new("мвел", "мвела", "мвелу", "мвела", "мвелом", "мвеле"),
      ["не"] = new("не", "не", "не", "не", "не", "не"),
      ["нила"] = new("нила", "нилы", "ниле", "нилу", "нилой", "ниле"),
      ["но"] = new("но", "но", "но", "но", "но", "но"),
      ["уи"] = new("уи", "уи", "уи", "уи", "уи", "уи"),
      ["э"] = new("э", "э", "э", "э", "э", "э"),
      ["я"] = new("я", "и", "е", "ю", "ёй", "е"),
    };


    /// <summary>
    /// Список данных для грамматик для женских отчеств.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FMidNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[вчш]на"] = new("на", "ны", "не", "ну", "ной", "не"),
    };


    /// <summary>
    /// Список данных для грамматик для мужских отчеств.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MMidNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[вкмть]ич"] = new("ич", "ича", "ичу", "ича", "ичем", "иче"),
    };


    /// <summary>
    /// Список данных для грамматик для мужских фамилий.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MLastNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[бвгдежзийклмнпрстфцч]о"] = new("о", "о", "о", "о", "о", "о"),
      ["[абвгеимноруэя]да"] = new("да", "ды", "де", "ду", "дой", "де"),
      ["[бвклмнпстц]и"] = new("и", "и", "и", "и", "и", "и"),
      ["[еиоую]г"] = new("г", "га", "гу", "га", "гом", "ге"),
      ["[зйлмстш]он"] = new("он", "она", "ону", "она", "оном", "оне"),
      ["ава"] = new("ава", "авы", "аве", "аву", "авой", "аве"),
      ["аец"] = new("аец", "айца", "айцу", "айца", "айцем", "айце"),
      ["ай"] = new("ай", "ая", "аю", "ая", "аем", "ае"),
      ["ак"] = new("ак", "ака", "аку", "ака", "аком", "аке"),
      ["ань"] = new("ань", "аня", "аню", "аня", "анем", "ане"),
      ["ач"] = new("ач", "ача", "ачу", "ача", "ачом", "аче"),
      ["ба"] = new("ба", "бы", "бе", "бу", "бой", "бе"),
      ["бей"] = new("бей", "бей", "бей", "бей", "бей", "бей"),
      ["бий"] = new("бий", "бий", "бий", "бий", "бий", "бий"),
      ["[аеиоуэя]вец"] = new("вец", "вца", "вцу", "вца", "вцом", "вце"),
      ["[жзклмнпрстхшШ]вец"] = new("вец", "веца", "вецу", "веца", "вецом", "веце"),
      ["вий"] = new("вий", "вий", "вий", "вий", "вий", "вий"),
      ["гий"] = new("гий", "гого", "гому", "гого", "гим", "гом"),
      ["дер"] = new("дер", "дера", "деру", "дера", "дером", "дере"),
      ["дец"] = new("дец", "дца", "дцу", "дца", "дцом", "дце"),
      ["дзе"] = new("дзе", "дзе", "дзе", "дзе", "дзе", "дзе"),
      ["дь"] = new("дь", "дя", "дю", "дя", "дём", "де"),
      ["е"] = new("е", "е", "е", "е", "е", "е"),
      ["ев"] = new("ев", "ьва", "ьву", "ьва", "ьвом", "ьве"),
      ["ёв"] = new("ёв", "ёва", "ёву", "ёва", "ёвым", "ёве"),
      ["ел"] = new("ел", "ел", "ел", "ел", "ел", "ел"),
      ["ерг"] = new("ерг", "ерга", "ергу", "ерга", "ергом", "ерге"),
      ["за"] = new("за", "зы", "зе", "зу", "зой", "зе"),
      ["заде"] = new("заде", "заде", "заде", "заде", "заде", "заде"),
      ["иа"] = new("иа", "иа", "иа", "иа", "иа", "иа"),
      ["иец"] = new("иец", "ийца", "ийцу", "ийца", "ийцем", "ийце"),
      ["ик"] = new("ик", "ика", "ику", "ика", "иком", "ике"),
      ["ин"] = new("ин", "ина", "ину", "ина", "иным", "ине"),
      ["их"] = new("их", "их", "их", "их", "их", "их"),
      ["ич"] = new("ич", "ича", "ичу", "ича", "ичем", "иче"),
      ["ия"] = new("ия", "ии", "ии", "ию", "ией", "ии"),
      ["кий"] = new("кий", "кого", "кому", "кого", "ким", "ком"),
      ["лец"] = new("лец", "льца", "льцу", "льца", "льцем", "льце"),
      ["лий"] = new("лий", "лия", "лию", "лия", "лием", "лие"),
      ["ль"] = new("ль", "ля", "лю", "ля", "лем", "ле"),
      ["льц"] = new("льц", "льца", "льцу", "льца", "льцем", "льце"),
      ["ля"] = new("ля", "ли", "ле", "лю", "лей", "ле"),
      ["ман"] = new("ман", "мана", "ману", "мана", "маном", "мане"),
      ["нен"] = new("нен", "нена", "нену", "нена", "неном", "нене"),
      ["нец"] = new("нец", "нца", "нцу", "нца", "нцем", "нце"),
      ["ня"] = new("ня", "ню", "не", "ню", "ней", "не"),
      ["ов"] = new("ов", "ова", "ову", "ова", "овым", "ове"),
      ["оглы"] = new("оглы", "оглы", "оглы", "оглы", "оглы", "оглы"),
      ["оз"] = new("оз", "оза", "озу", "оза", "озом", "озе"),
      ["ой"] = new("ой", "ого", "ому", "ого", "им", "ом"),
      ["онь"] = new("онь", "оня", "оню", "оня", "онём", "оне"),
      ["рий"] = new("рий", "рий", "рий", "рий", "рий", "рий"),
      ["рс"] = new("рс", "рса", "рсу", "рса", "рсом", "рсе"),
      ["рц"] = new("рц", "рца", "рцу", "рца", "рцем", "рце"),
      ["рь"] = new("рь", "ря", "рю", "ря", "рём", "ре"),
      ["сен"] = new("сен", "сена", "сену", "сена", "сеном", "сене"),
      ["сий"] = new("сий", "сия", "сию", "сия", "сием", "сие"),
      ["тий"] = new("тий", "тий", "тий", "тий", "тий", "тий"),
      ["тор"] = new("тор", "тора", "тору", "тора", "тором", "торе"),
      ["уа"] = new("уа", "уа", "уа", "уа", "уа", "уа"),
      ["ук"] = new("ук", "ука", "уку", "ука", "уком", "уке"),
      ["ула"] = new("ула", "улы", "уле", "улу", "улой", "уле"),
      ["ус"] = new("ус", "уса", "усу", "уса", "усом", "усе"),
      ["ша"] = new("ша", "ши", "ше", "шу", "шой", "ше"),
      ["щ"] = new("щ", "ща", "щу", "ща", "щом", "ще"),
      ["ый"] = new("ый", "ого", "ому", "ого", "ым", "ом"),
      ["ын"] = new("ын", "ына", "ыну", "ына", "ыным", "ыне"),
      ["ых"] = new("ых", "ых", "ых", "ых", "ых", "ых"),
      ["ыч"] = new("ыч", "ыча", "ычу", "ыча", "ычом", "ыче"),
      ["э"] = new("э", "э", "э", "э", "э", "э"),
      ["юк"] = new("юк", "юка", "юку", "юка", "юком", "юке"),
      ["юх"] = new("юх", "юха", "юху", "юха", "юхом", "юхе"),
      ["як"] = new("як", "яка", "яку", "яка", "яком", "яке"),
      ["яка"] = new("яка", "яки", "яке", "яку", "якой", "яке"),
      ["ян"] = new("ян", "яна", "яну", "яна", "яном", "яне"),
      ["янь"] = new("янь", "янь", "янь", "янь", "янь", "янь"),

    };


    /// <summary>
    /// Список данных для грамматик для женских фамилий.
    /// </summary>
    public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FLastNames => new Dictionary<string, (string, string, string, string, string, string)>
    {
      ["[бвгдежзийклмнпрстфцч]о"] = new("о", "о", "о", "о", "о", "о"),
      ["[бвгмнря]да"] = new("да", "да", "да", "да", "да", "да"),
      ["[бвклмнпстц]и"] = new("и", "и", "и", "и", "и", "и"),
      ["[еиоую]г"] = new("г", "г", "г", "г", "г", "г"),
      ["[еиэ]да"] = new("да", "да", "да", "да", "да", "да"),
      ["[зйлмстш]он"] = new("он", "он", "он", "он", "он", "он"),
      ["ава"] = new("ава", "ава", "ава", "ава", "ава", "ава"),
      ["аец"] = new("аец", "аец", "аец", "аец", "аец", "аец"),
      ["ай"] = new("ай", "ай", "ай", "ай", "ай", "ай"),
      ["ак"] = new("ак", "ак", "ак", "ак", "ак", "ак"),
      ["ань"] = new("ань", "ань", "ань", "ань", "ань", "ань"),
      ["ач"] = new("ач", "ач", "ач", "ач", "ач", "ач"),
      ["ба"] = new("ба", "ба", "ба", "ба", "ба", "ба"),
      ["бей"] = new("бей", "бей", "бей", "бей", "бей", "бей"),
      ["бий"] = new("бий", "бий", "бий", "бий", "бий", "бий"),
      ["вец"] = new("вец", "вец", "вец", "вец", "вец", "вец"),
      ["вий"] = new("вий", "вий", "вий", "вий", "вий", "вий"),
      ["гий"] = new("гий", "гий", "гий", "гий", "гий", "гий"),
      ["дер"] = new("дер", "дер", "дер", "дер", "дер", "дер"),
      ["дец"] = new("дец", "дец", "дец", "дец", "дец", "дец"),
      ["дзе"] = new("дзе", "дзе", "дзе", "дзе", "дзе", "дзе"),
      ["дь"] = new("дь", "дь", "дь", "дь", "дь", "дь"),
      ["е"] = new("е", "е", "е", "е", "е", "е"),
      ["ева"] = new("ева", "евой", "евой", "еву", "евой", "евой"),
      ["ёва"] = new("ёва", "ёвой", "ёвой", "ёву", "ёвой", "ёвой"),
      ["ел"] = new("ел", "ел", "ел", "ел", "ел", "ел"),
      ["ерг"] = new("ерг", "ерг", "ерг", "ерг", "ерг", "ерг"),
      ["заде"] = new("заде", "заде", "заде", "заде", "заде", "заде"),
      ["иа"] = new("иа", "иа", "иа", "иа", "иа", "иа"),
      ["иец"] = new("иец", "иец", "иец", "иец", "иец", "иец"),
      ["ик"] = new("ик", "ик", "ик", "ик", "ик", "ик"),
      ["ина"] = new("ина", "иной", "иной", "ину", "иной", "иной"),
      ["их"] = new("их", "их", "их", "их", "их", "их"),
      ["ич"] = new("ич", "ич", "ич", "ич", "ич", "ич"),
      ["ия"] = new("ия", "ия", "ия", "ия", "ия", "ия"),
      ["кая"] = new("кая", "кой", "кой", "кую", "кой", "кой"),
      ["лец"] = new("лец", "лец", "лец", "лец", "лец", "лец"),
      ["лий"] = new("лий", "лий", "лий", "лий", "лий", "лий"),
      ["ль"] = new("ль", "ль", "ль", "ль", "ль", "ль"),
      ["льц"] = new("льц", "льц", "льц", "льц", "льц", "льц"),
      ["ля"] = new("ля", "ли", "ле", "лю", "лей", "ле"),
      ["ман"] = new("ман", "ман", "ман", "ман", "ман", "ман"),
      ["нен"] = new("нен", "нен", "нен", "нен", "нен", "нен"),
      ["нец"] = new("нец", "нец", "нец", "нец", "нец", "нец"),
      ["ова"] = new("ова", "овой", "овой", "ову", "овой", "овой"),
      ["оглы"] = new("оглы", "оглы", "оглы", "оглы", "оглы", "оглы"),
      ["оз"] = new("оз", "оз", "оз", "оз", "оз", "оз"),
      ["ая"] = new("ая", "ой", "ой", "ую", "ой", "ой"),
      ["онь"] = new("онь", "онь", "онь", "онь", "онь", "онь"),
      ["рий"] = new("рий", "рий", "рий", "рий", "рий", "рий"),
      ["рс"] = new("рс", "рс", "рс", "рс", "рс", "рс"),
      ["рц"] = new("рц", "рц", "рц", "рц", "рц", "рц"),
      ["рь"] = new("рь", "рь", "рь", "рь", "рь", "рь"),
      ["сен"] = new("сен", "сен", "сен", "сен", "сен", "сен"),
      ["сий"] = new("сий", "сий", "сий", "сий", "сий", "сий"),
      ["тий"] = new("тий", "тий", "тий", "тий", "тий", "тий"),
      ["тор"] = new("тор", "тор", "тор", "тор", "тор", "тор"),
      ["уа"] = new("уа", "уа", "уа", "уа", "уа", "уа"),
      ["ук"] = new("ук", "ук", "ук", "ук", "ук", "ук"),
      ["ула"] = new("ула", "ула", "ула", "ула", "ула", "ула"),
      ["ус"] = new("ус", "ус", "ус", "ус", "ус", "ус"),
      ["ша"] = new("ша", "ши", "ше", "шу", "шой", "ше"),
      ["щ"] = new("щ", "щ", "щ", "щ", "щ", "щ"),
      //["ый"] = new("ая", "ой", "ой", "ую", "ой", "ой"),
      ["ына"] = new("ына", "ыной", "ыной", "ыну", "ыной", "ыной"),
      ["ых"] = new("ых", "ых", "ых", "ых", "ых", "ых"),
      ["ыч"] = new("ыч", "ыч", "ыч", "ыч", "ыч", "ыч"),
      ["э"] = new("э", "э", "э", "э", "э", "э"),
      ["юк"] = new("юк", "юк", "юк", "юк", "юк", "юк"),
      ["юх"] = new("юх", "юх", "юх", "юх", "юх", "юх"),
      ["як"] = new("як", "як", "як", "як", "як", "як"),
      ["яка"] = new("яка", "яка", "яка", "яка", "яка", "яка"),
      ["ян"] = new("ян", "ян", "ян", "ян", "ян", "ян"),
      ["янь"] = new("янь", "янь", "янь", "янь", "янь", "янь"),

    };

  }


}
